# TooManyFacesEdges Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..TooManyFacesEdges Property
BuiltInFailures..::..GeometryFailures Class See Also
---
This family instance has too many [Edges and Faces]. Remove unnecessary geometry or split the instance into multiple instances.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TooManyFacesEdges { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TooManyFacesEdges As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TooManyFacesEdges {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace